In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
# creating dataframes for both log_feature and train
filename = os.path.join(os.getcwd(), "iot-datasets", "log_feature.csv")
log_df = pd.read_csv(filename, header=0)

filename = os.path.join(os.getcwd(), "iot-datasets", "train.csv")
train_df = pd.read_csv(filename, header=0)

filename = os.path.join(os.getcwd(), "iot-datasets", "test.csv")
test_df = pd.read_csv(filename, header=0)

In [3]:
log_df.head()

     id  log_feature  volume
0  6597   feature 68       6
1  8011   feature 68       7
2  2597   feature 68       1
3  5022  feature 172       2
4  5022   feature 56       1

In [4]:
train_df.head()

      id      location  fault_severity
0  14121  location 118               1
1   9320   location 91               0
2  14394  location 152               1
3   8218  location 931               1
4  14804  location 120               0

In [5]:
test_df.head()

      id      location
0  11066  location 481
1  18000  location 962
2  16964  location 491
3   4795  location 532
4   3392  location 600

In [6]:
# confirming that the IDs in train are all unique so there won't be any M:M
print(np.size(train_df['id']))
print(np.size(train_df['id'].unique()))

7381
7381

In [7]:
# confirming that the IDs in test are all unique so there won't be any M:M
print(np.size(test_df['id']))
print(np.size(test_df['id'].unique()))

11171
11171

In [8]:
# putting the unique ID set from train and tests into lists
train_id = train_df['id']
test_id = test_df['id']
#print(train_id)

In [9]:
# saving value counts for each id to lists
train_id_counts = train_df['id'].value_counts()
test_id_counts = test_df['id'].value_counts()

In [10]:
# creating two labels. one to show if the id is 1:1 and the other to show if it's 1:M
train_df['one_to_one'] = log_df['id'].apply(lambda x: 1 if train_id_counts.get(x, 0) < 2 else 0)
train_df['one_to_many'] = log_df['id'].apply(lambda x: 1 if train_id_counts.get(x, 0) > 1 else 0)
train_df.head()

      id      location  fault_severity  one_to_one  one_to_many
0  14121  location 118               1           1            0
1   9320   location 91               0           1            0
2  14394  location 152               1           1            0
3   8218  location 931               1           1            0
4  14804  location 120               0           1            0

In [11]:
# creating two labels. one to show if the id is 1:1 and the other to show if it's 1:M
test_df['one_to_one'] = log_df['id'].apply(lambda x: 1 if test_id_counts.get(x, 0) < 2 else 0)
test_df['one_to_many'] = log_df['id'].apply(lambda x: 1 if test_id_counts.get(x, 0) > 1 else 0)
test_df.head()

      id      location  one_to_one  one_to_many
0  11066  location 481           1            0
1  18000  location 962           1            0
2  16964  location 491           1            0
3   4795  location 532           1            0
4   3392  location 600           1            0

In [13]:
# printing the size of the new column to confirm its the same size of the original ID column as it should be
print("Size of Train 1:1: " + str(np.size(train_df['one_to_one'])))
print("Size of Train 1:M: " + str(np.size(train_df['one_to_many'])))
print("Size of Test 1:1: " + str(np.size(test_df['one_to_one'])))
print("Size of Test 1:M: " + str(np.size(test_df['one_to_many'])))

Size of Train 1:1: 7381
Size of Train 1:M: 7381
Size of Test 1:1: 11171
Size of Test 1:M: 11171